import { Button } from "@material-tailwind/react";
import React from "react";

const Intro = () => {
  return (
    <div className="mt-10 mx-auto max-w-4xl">
      <h1 className="font-semibold text-3xl text-center">
        أحلامي لتفسير الأحلام بواسطة الذكاء الاصطناعي
      </h1>
      <h2 className="mt-5 text-gray-700 font-medium text-sm text-center">
        جرب قاموس تفسير الأحلام الذي يعتمد على الذكاء الاصطناعي اليوم واكتشف
        بنفسك مدى دقته وشموليته. ستجد فيه أحدث المعلومات والتحديثات المستمرة في
        قاعدة بياناتنا التي تضم أكثر من 100,000 حلم. ببساطة، أدخل حلمك في شريط
        البحث وسيقدم لك الذكاء الاصطناعي تفسيرًا دقيقًا في ثوانٍ. والأفضل من
        ذلك، الاستخدام مجاني. استفد الآن من قاموس تفسير الأحلام الذي يعتمد على
        الذكاء الاصطناعي وتفاسير كبار المفسرين والمشايخ وعلم النفس وتأكد بنفسك
        من دقته وشموليته.
      </h2>

    </div>
  );
};

export default Intro;
