import React from "react";
import { Link } from "react-router-dom";

const Policies = () => {
  const policyContent = [
    {
      title: "الشروط والاحكام",
      parag: `تخضع هذه الشروط والأحكام وبيان الخصوصية وإشعار الإخلاء، وجميع 
            الاتفاقيات، للمصطلحات التالية: "العميل" و"أنت" و"أنت" تشير إليك،
            الشخص الذي يقوم بتسجيل الدخول إلى هذا الموقع ويوافق على شروط وأحكام 
            الشركة. يشار إلى شركتنا بأنها "الشركة" و"أنفسنا" و"نحن" و"نا" 
            و"إيانا". كل من العميل وأنفسنا يشار إليهما بـ "الطرف" أو "الأطراف" 
            أو "نحن". جميع المصطلحات تشير إلى العرض والقبول والاعتبار الذي يلزم 
            لبدء عملية مساعدتنا للعميل بأكثر الطرق المناسبة لتلبية احتياجات 
            العميل فيما يتعلق بالخدمات المحددة للشركة، وفقًا للتشريعات الهولندية 
            المعمول بها وطبقًا لها. يفترض أن أي استخدام للغة المذكورة أعلاه، 
            فضلاً عن الكلمات الأخرى في الصيغة المفردة أو الجمع، أو الحروف 
            الكبيرة / الصغيرة، و / أو هو / هي أو هم، تعني الشيء نفسه.`,
    },
    {
      title: "ملفات تعريف الارتباط",
      parag: `تُستخدم ملفات تعريف الارتباط على هذا الموقع. قمت بالموافقة على 
            استخدام ملفات تعريف الارتباط وفقًا لسياسة الخصوصية الخاصة بـ a7lamy 
            من خلال زيارة a7lamy. يتم استخدام ملفات تعريف الارتباط من قِبل معظم 
            المواقع التفاعلية لتتيح لنا استرداد معلومات المستخدم لكل زيارة. يتم 
            استخدام ملفات تعريف الارتباط على موقعنا للسماح بعمل مناطق محددة وجعل 
            الأمور أسهل للمستخدمين. قد يستخدم بعض شركائنا التابعين / الإعلانات 
            ملفات تعريف الارتباط أيضًا.`,
    },
    {
      title: "ترخيص",
      parag: `ما لم يذكر خلاف ذلك، فجميع حقوق الملكية الفكرية في جميع المواد الموجودة على a7lamy هي ملك a7lamy و / أو المرخصين الخاصة به. جميع حقوق الملكية الفكرية محفوظة. يمكنك استخدام ذلك للاستخدام الشخصي الخاص بك من a7lamy، وذلك بشرط القيود المنصوص عليها في هذه الشروط والأحكام.

لا يجوز لك:

إعادة نشر المواد من a7lamy
بيع أو تأجير أو إعطاء ترخيص المواد من a7lamy للآخرين
استنساخ أو تكرار أو نسخ المواد من a7lamy
إعادة توزيع محتوى من a7lamy
أجزاء من هذا الموقع تسمح للمستخدمين بنشر وتبادل الأفكار والمعلومات في الأماكن المحددة. قبل ظهورها على الإنترنت، لا يقوم a7lamy بتصفية أو تحرير أو نشر أو مراجعة التعليقات. لا تعكس الأفكار والآراء المعبر عنها في التعليقات آراء a7lamy أو وكلائها أو تابعيها. تعكس وجهات النظر وآراء التعليقات وجهات نظر وآراء الشخص الفردي الذي نشرها. لا يتحمل a7lamy مسؤولية عن التعليقات أو أي التزامات أو أضرار أو نفقات يسببها و / أو يعاني منها نتيجة استخدام و / أو نشر و / أو ظهور التعليقات على هذا الموقع، إلى الحد المسموح به من قبل القوانين المعمول بها.

يحق لـ a7lamy مراجعة جميع التعليقات وإزالة أي تعليقات غير مناسبة أو مسيئة أو تنتهك شروطنا وأحكامنا.

أنت تضمن وتمثل أن:

لديك الحقوق الأساسية والموافقة على نشر التعليقات على موقعنا، ولقد تم منحك إذن للقيام بذلك.
لا تنتهك التعليقات حقوق الملكية الفكرية لأطراف ثالثة، مثل حقوق النشر أو البراءات أو العلامات التجارية.
في التعليقات، لا يوجد محتوى لاإنساني أو مسيء أو مخل بالآداب أو غير قانوني يشكل انتهاكًا للخصوصية.
لن يتم استخدام التعليقات لترويج أو دعم أي نوع من أنواع الأعمال أو العادات التجارية الحالية أو الغير قانونية.
من خلال ذلك، تمنح a7lamy ترخيصًا غير حصري لاستخدام واستنساخ وتحرير وإذن الآخرين باستخدام واستنساخ وتحرير وإذن الآخرين باستخدام واستنساخ وتحرير التعليقات الخاصة بك في أي شكل أو شكل أو وسائط.`,
    },
    {
      title: "الارتباط بمحتوانا",
      parag: `بدون إذن مسبق بالكتابة، يمكن للمنظمات التالية الارتباط بموقعنا:

وكالات الحكومة
محركات البحث
المؤسسات الإخبارية
يمكن لموزعي الدلائل عبر الإنترنت الارتباط بموقعنا بنفس الطريقة التي يتصلون بها بمواقع الشركات الأخرى المدرجة في الدليل.
باستثناء المنظمات غير الربحية التي تقوم بجمع التبرعات والمجمعات التجارية التي لا يُسمح لها بالارتباط بموقعنا.
قد تقوم هذه المنظمات بالارتباط بصفحتنا الرئيسية أو النشرات أو محتوى موقع الويب الآخر طالما أن الرابط يتوافق مع المعايير التالية: (أ) لا يكون غامضًا بأي شكل من الأشكال؛ (ب) لا يوحي بأن الجهة المرتبطة أو منتجاتها و / أو خدماتها مرعية أو موافق عليها بأي شكل من الأشكال؛ و (ج) يتوافق بشكل جيد مع موضوع موقع الطرف الرابط.

يمكن النظر في طلبات الرابط من الفئات التالية من المنظمات والموافقة عليها:

مصادر المعلومات المعروفة والشائعة للمستهلك و / أو المعلومات التجارية
الجمعيات أو المجموعات الأخرى التي تمثل الجمعيات الخيرية
موزعي الدلائل عبر الإنترنت
البوابات الإنترنت
المؤسسات التعليمية وجمعيات الصناعة
سنوافق على طلبات الرابط من هذه المنظمات إذا قررنا أن: (أ) الرابط لن يعكس علينا أو على أعمالنا المعتمدة بشكل سلبي؛ (ب) ليس لدى المنظمة سجلات سلبية معنا؛ (ج) يعوض الفائدة لنا من ظهور الارتباط عن غياب a7lamy، و (د) سيتم الارتباط في سياق معلومات المصدر العامة.

ترحب هذه المنظمات بالربط بصفحتنا الرئيسية طالما أن الرابط: (أ) ليس مضللًا؛ (ب) لا يعطي انطباعًا كاذبًا برعاية أو تأييد الطرف المرتبط أو منتجاته أو خدماته؛ و (ج) مناسب لموقع الطرف المرتبط.

يرجى التواصل معنا عبر البريد الإلكتروني على a7lamy إذا كنت أحد المنظمات المدرجة في الفقرة 2 أعلاه وترغب في الربط بموقعنا. قم بتضمين اسمك واسم مؤسستك ومعلومات الاتصال وعنوان URL لموقعك، بالإضافة إلى قائمة بأي عناوين URL تنوي الارتباط بها من موقعنا وقائمة بعناوين URL على موقعنا التي تود الارتباط بها. توقع الرد في غضون أسبوعين إلى ثلاثة أسابيع.`,
    },
    {
      title: "iFrames",
      parag: `من دون موافقة مسبقة واتفاق مكتوب، قد لا تضع إطارات حول صفحات الويب الخاصة بنا التي تغير العرض البصري أو مظهر موقعنا على الويب.`,
    },
    {
      title: "مسؤولية المحتوى",
      parag: `لسنا مسؤولين عن أي من المحتويات على موقع الويب الخاص بك. توافق على الدفاع عنا وتعويضنا في حالة حدوث أي نزاعات ناتجة عن موقع الويب الخاص بك. على أي موقع ويب، لا يجب أن يكون هناك رابط (روابط) يمكن اعتبارها مجديفة أو بذيئة أو غير قانونية، أو تنتهك، أو تنتهك بطرق أخرى، أو تشجع على انتهاك حقوق الطرف الثالث.`,
    },
    {
      title: "خصوصيتك",
      parag: (
        <span>
          يرجى قراءة
          <Link to="/privacy-policy" className="text-blue-500 underline">
            سياسة الخصوصية
          </Link>
          .
        </span>
      ),
    },
    {
      title: "احتفاظ الحقوق",
      parag: `نحتفظ بالحق في طلب منك حذف أي اتصالات أو روابط معينة إلى موقعنا. بناءً على طلبنا، تتعهد بفصل أي اتصالات على الفور إلى موقعنا. تخضع هذه الشروط والأحكام، وكذلك سياسة الربط، للتغيير في أي وقت. إذا استمررت في الربط إلى موقعنا، فإنك توافق على الالتزام بشروط وأحكام الربط هذه.`,
    },
    {
      title: "إزالة الروابط من موقعنا",
      parag: `إذا وجدت أي رابط على موقعنا يُعتبر مسيئًا لأي سبب، فندعوك للاتصال بنا وإبلاغنا في أي وقت. سننظر في طلبات إزالة الروابط، ولكننا لسنا ملزمين بالقيام بذلك أو الرد عليك شخصيًا.`,
    },
    {
      title: "إخلاء المسؤولية",
      parag: `إلى أقصى حد يسمح به القانون المعمول به، ننكر أي وجميع المطالبات والضمانات والشروط المتعلقة بموقعنا واستخدامه. لا ينبغي استخدام أي شيء في هذا الإخلاء بأنه:

يقلل أو يقضي على المسؤولية الخاصة بنا أو بك في حالة الوفاة أو الإصابة الشخصية
يحد أو يستبعد المسؤولية الخاصة بنا أو بك عن الاحتيال أو الغش
يحد أيًا من المسؤوليات الخاصة بنا أو بك بأي طريقة لا يسمح بها القانون
يستبعد أيًا من المسؤوليات الخاصة بنا أو بك التي لا يسمح بها القانون ذات الصلة للاستبعاد.
تنطبق قيود المسؤولية والمحظورات المنصوص عليها في هذا القسم وفي أماكن أخرى في هذا الإخلاء على ما يلي: (أ) تخضع لأحكام الفقرة السابقة؛ و (ب) جميع المسؤوليات الناشئة بموجب الإخلاء تخضع لهذه الشروط، بما في ذلك تلك المنبثقة عن العقد أو القرار الجنائي أو انتهاك الواجب القانوني.`,
    },
  ];

  return (
    <div className="mt-8 flex flex-col px-4 text-gray-700 space-y-4 mx-[2em]">
      <ul>
        {policyContent.map((policy, index) => (
          <li key={index}>
            <p className="py-4 text-2xl font-bold">{policy.title}</p>
            <h4 className="py-[1em] text-gray-600">{policy.parag}</h4>
          </li>
        ))}
      </ul>
    </div>
  );
};

export default Policies;
